Revit 2026 API

# LayoutRule Class

---

The LayoutRule object is a base object for all type of layout rules for Beam System within the Autodesk Revit API.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBLayoutRule Autodesk.Revit.DBLayoutRuleClearSpacing Autodesk.Revit.DBLayoutRuleFixedDistance Autodesk.Revit.DBLayoutRuleFixedNumber Autodesk.Revit.DBLayoutRuleMaximumSpacing

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class LayoutRule : APIObject
```
```vb
Public MustInherit Class LayoutRule
	Inherits APIObject
```
```cpp
public ref class LayoutRule abstract : public APIObject
```
```fsharp
[<AbstractClassAttribute>]
type LayoutRule =
    class
        inherit APIObject
    end
```

The LayoutRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This class just used as the base class of those concrete LayoutRule classes.

#### Reference

Autodesk.Revit.DB Namespace